app/Controllers/AuthController.php

SELECT *
FROM `user`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function cek_login()
    {
        $users    = new User();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $dataUser = $users->where([
            'username' => $username,
        ])->first();