app/Controllers/ObatController.php

    public function index()
    {
        $obat = new obat();
        $data = array(
            'title' => 'Data Obat',
            'data_obat' => $obat->findAll(),
---
SELECT *
FROM `tbl_obat`