app/Controllers/UserController.php

    public function index()
    {
        $user = new User();
        $data = array(
            'title' => 'Data User',
            'data_user' => $user->whereIn('role', ['admin','kasir','dokter'])->findAll(),
---
SELECT *
FROM `user`
WHERE `role` IN ('admin','kasir','dokter')

    public function customer()
    {
        $user = new User();
        $data = array(
            'title' => 'Data Customer',
            'data_user' => $user->where('role','customer')->findAll(),
---
SELECT *
FROM `user`
WHERE `role` = 'customer'