app/Models/Pendaftaran.php

SELECT `tbl_pendaftaran`.*, `user`.`nama_user`
FROM `tbl_pendaftaran`
JOIN `user` ON `user`.`id` = `tbl_pendaftaran`.`id_customer`
ORDER BY `tbl_pendaftaran`.`id` DESC
---
    public function getAllData()
    {
        $db = \Config\Database::connect();

        $builder = $db->table('tbl_pendaftaran');
        $builder->select('tbl_pendaftaran.*, user.nama_user');
        $builder->join('user', 'user.id = tbl_pendaftaran.id_customer');
        $builder->orderBy('tbl_pendaftaran.id','DESC');

        $query = $builder->get();